Tekla Open API Reference for Tekla Structures 2025
Beam Constructor
 Initializes a new instance of the Beam class. The start and end points are in the origin.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Beam()
Public Sub New
See Also
Reference
Beam Class
Beam Overload
Tekla.Structures.Model Namespace